Table of Contents
 Interface IIdeaMaterialLibrary
Namespace
IdeaStatiCa.BimApi
Assembly
IdeaStatiCa.BimApi.dll
TODO
public interface IIdeaMaterialLibrary
Methods
 GetMaterialNames()
@return
HashSet<string> GetMaterialNames()
Returns
HashSet<string>
 IsValidIdeaMaterialName(string)
@param materialName @return
bool IsValidIdeaMaterialName(string materialName)
Parameters
materialName string
Returns
bool
 Edit this page